<a href="https://colab.research.google.com/github/jnelly79/Colorado_Solar_Installation_Adoption_Rates_DS/blob/master/data_cleaning/cleaning_total_energy_production_CO_US_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Import pandas
import pandas as pd

In [ ]:
# Read in the data for total energy production in US/CO.
df = pd.read_excel('/content/drive/My Drive/datasets/data_practicum/total_energy_production_US_in_btu.xlsx', sheet_name='cleaning')

In [ ]:
df.head()

        State  ...  Overall Total btu
0     Alabama  ...           1227.157
1      Alaska  ...           1453.518
2     Arizona  ...            621.083
3    Arkansas  ...            994.612
4  California  ...           2535.788

[5 rows x 9 columns]

In [ ]:
# Find out what the dtypes of the columns are,
df.dtypes

State                                          object
Coal                                          float64
Natural Gas                                    object
Crude Oil                                      object
Nuclear Electric Power                        float64
Biofuels                                      float64
Other Renewable Energy                        float64
Total Renewable energy without Biofuel btu    float64
Overall Total btu                             float64
dtype: object

In [ ]:
#  Convert everything to str format.
df = df.astype(str)

In [ ]:
# Function to convert total number of integers.
def convert_si_to_number(x):
    total_stars = 0
    if '.' in x:
      total_stars = float(x.replace('.', '')) * 1000000000 # convert trillion
    elif '(s)' in x:
      total_stars = float(x.replace('(s)','0.05'))
    elif 'nan' in x:
      pass
    else:
        total_stars = int(x) # Less than 1000
    
    return int(total_stars)

In [ ]:
# Store the reformatted data back into the datframe.
df['Coal'] = df['Coal'].apply(convert_si_to_number)
df['Natural Gas'] = df['Natural Gas'].apply(convert_si_to_number)
df['Crude Oil'] = df['Crude Oil'].apply(convert_si_to_number)
df['Nuclear Electric Power'] = df['Nuclear Electric Power'].apply(convert_si_to_number)
df['Biofuels'] = df['Biofuels'].apply(convert_si_to_number)
df['Other Renewable Energy'] = df['Other Renewable Energy'].apply(convert_si_to_number)
df['Total Renewable energy without Biofuel btu'] = df['Total Renewable energy without Biofuel btu'].apply(convert_si_to_number)
df['Overall Total btu'] = df['Overall Total btu'].apply(convert_si_to_number)

In [ ]:
df.head()

        State  ...  Overall Total btu
0     Alabama  ...   1227157000000000
1      Alaska  ...   1453518000000000
2     Arizona  ...    621083000000000
3    Arkansas  ...    994612000000000
4  California  ...   2535788000000000

[5 rows x 9 columns]

In [ ]:
# Export the data into a csv or excel file.
df.to_excel('/content/drive/My Drive/datasets/data_practicum/total_energy_production_US_in_btu_clean.xlsx', sheet_name='cleaned')